#+STARTUP: showeverything
  # /app/google-translate/readme.org


#+TITLE: 표의 형태로 만들어 내는 것이 성공적이었음
- 단 eww에서 번역기가 제대로 작동하면 매우 수집과 창의적인 전개가 가능할 것임.
 study : package의 오류를 찾아서 공부하는 법.
단독으로 만들어서 사용하는 법.
- 빈버퍼를 만드는 것을 봤음. 빈버퍼에 선택영역을 실행하는 간단한함수를 만들어 보는 것이 중요할 것이다.

* make my-trans in emacs.el



* emacs  download google-translate.el
#+BEGIN_SRC emacs-lisp :note saved in emacsQ_load.el
(use-package google-translate ;; /app/google-translate/readme.org
;(require 'google-translate) ;; $ yay translate-shell # trans -R
  ;;:init
  ;;(setq foo-variable t)
    :config
;(require 'google-translate-default-ui)
;(global-set-key "\C-ct" 'google-translate-at-point)
;(global-set-key "\C-cT" 'google-translate-query-translate)

;(setq google-translate-default-target-language  "latin+ko"
; google-translate-default-source-language "en")
;(setq google-translate-default-target-language  nil
; google-translate-default-source-language "en")

(require 'google-translate-smooth-ui)
(global-set-key "\C-ct" 'google-translate-smooth-translate)
(setq google-translate-translation-directions-alist
      '(("en" . "ko") ("en" . "la") 
	("ko" . "en") ("ko" . "la") ("ko" . "el")  
	 ("la" . "ko")  ("la" . "en")
	("en" . "el") ("en" . "he")))

)
#+END_SRC




* shell $ yay translate-shell # trans -R

#+BEGIN_SRC sh :results raw
trans -b -d -s en -t ko+la "hello world is good"
#+END_SRC

#+RESULTS:
안녕 세상은 좋다
salve mundus bonum
hello world

안녕 세상




#+BEGIN_SRC sh :results raw
trans -b -d -s en -t ko+la -I
#+END_SRC

#+RESULTS:


#+BEGIN_SRC sh :results raw
str="
 I intend to try, if  not to solve  it, at least to  examine and discuss it face to face with my readers, were it only to persuade them to answer it for themselves, and, if I can, to make their opinion and mine on the point clear. 
"

echo "$str

"
trans -b -d -s en -t ko+la "$str"
#+END_SRC

#+RESULTS:

 I intend to try, if  not to solve  it, at least to  examine and discuss it face to face with my readers, were it only to persuade them to answer it for themselves, and, if I can, to make their opinion and mine on the point clear. 



나는 그것을 해결하지 않으면 적어도 독자들과 직접 대면하여 조사하고 토론하려고 노력하고, 독자들에게 스스로 대답하고, 가능하다면 그들의 의견과 의견을 밝히도록 설득해야 했습니까? 요점은 분명하다.
Animo ad conandum nisi solvere saltem inspicere disseretur obviam legentibus essent solum suasit respondebit sibi et si possunt facere sententiam meis patet punctum.


* yay translate-shell # trans -R
